[
    {
        "UserName": "Firestarter",
        "Gender": "male",
        "InterestedIn": "any",
        "DateOfBirth": "1990-12-01",
        "KnownAs": "Firestarter",
        "Created": "2019-11-30",
        "LastActive": "2020-05-07",
        "Introduction": "I am a superhero with the ability to generate and control fire. I am looking for someone who is confident and fearless, just like me. Together, we can take on the world.",
        "LookingFor": "I am looking for a partner who can match my power and courage. Someone who is not afraid to stand by me and face any challenges that come our way.",
        "Interests": "Fighting crime, saving the world, and keeping fit.",
        "City": "Metropolis",
        "State": "New York",
        "Photos": [
            {
                "Url": "https://res.cloudinary.com/littleboomgames/image/upload/v1675316924/DatingApp/firestarter_qgjrzt.jpg",
                "IsMain": true
            }
        ]
    },
    {
        "UserName": "Storm",
        "Gender": "female",
        "InterestedIn": "male",
        "DateOfBirth": "1987-07-14",
        "KnownAs": "Storm",
        "Created": "2019-12-01",
        "LastActive": "2020-05-08",
        "Introduction": "I am the master of the weather and can control the elements with my powers. I am looking for someone who can keep up with my dynamic and adventurous lifestyle.",
        "LookingFor": "I am looking for someone who is bold and confident. Someone who can accompany me on my adventures and face any challenges that come our way.",
        "Interests": "Exploring the world, fighting crime, and finding new ways to use my powers.",
        "City": "Gotham",
        "State": "California",
        "Photos": [
            {
                "Url": "https://res.cloudinary.com/littleboomgames/image/upload/v1675316925/DatingApp/storm_jvwihh.jpg",
                "IsMain": true
            }
        ]
    },
    {
        "UserName": "Flash",
        "Gender": "male",
        "InterestedIn": "female",
        "DateOfBirth": "1989-01-12",
        "KnownAs": "The Flash",
        "Created": "2019-12-02",
        "LastActive": "2020-05-09",
        "Introduction": "I am the fastest man alive and can run at superhuman speeds. I am always on the go and looking for someone who can keep up with my pace.",
        "LookingFor": "I am looking for someone who is energetic and loves to live life to the fullest. Someone who is always ready for new adventures and can keep up with my fast-paced lifestyle.",
        "Interests": "Running, fighting crime, and keeping fit.",
        "City": "Central City",
        "State": "Texas",
        "Photos": [
            {
                "Url": "https://res.cloudinary.com/littleboomgames/image/upload/v1675316924/DatingApp/flash_g33oda.jpg",
                "IsMain": true
            }
        ]
    },
    {
        "UserName": "Zeus",
        "Gender": "male",
        "InterestedIn": "any",
        "DateOfBirth": "1980-12-05",
        "KnownAs": "Zeus",
        "Created": "2020-05-08",
        "LastActive": "2021-12-31",
        "Introduction": "I am the ruler of the gods and king of Mount Olympus. I am known for my mastery of lightning bolts and my powerful voice. I am searching for a strong and confident partner to share my life with.",
        "LookingFor": "I am looking for a confident and intelligent partner who is not afraid to stand up to me. Someone who values strength, wisdom, and courage and is able to keep up with my active lifestyle.",
        "Interests": "My interests include spending time on Mount Olympus, mastering lightning bolts, and spending time with my family.",
        "City": "Athens",
        "State": "Greece",
        "Photos": [
            {
                "Url": "https://res.cloudinary.com/littleboomgames/image/upload/v1675316925/DatingApp/zeus_iu28ip.jpg",
                "IsMain": true
            }
        ]
    },
    {
        "UserName": "Hera",
        "Gender": "female",
        "InterestedIn": "any",
        "DateOfBirth": "1985-04-22",
        "KnownAs": "Hera",
        "Created": "2020-05-08",
        "LastActive": "2021-12-31",
        "Introduction": "I am the queen of the gods and the goddess of marriage and women. I am a strong and intelligent leader, who values family and loyalty above all else. I am searching for a partner who shares my values and supports me in all my endeavors.",
        "LookingFor": "I am looking for a kind and understanding partner who is able to communicate well and share my values. Someone who values family, loyalty, and hard work, and is willing to stand by me through thick and thin.",
        "Interests": "My interests include spending time on Mount Olympus, managing my household, and spending time with my family.",
        "City": "Mount Olympus",
        "State": "Greece",
        "Photos": [
            {
                "Url": "https://res.cloudinary.com/littleboomgames/image/upload/v1675316924/DatingApp/hera_efezmx.jpg",
                "IsMain": true
            }
        ]
    },
    {
        "UserName": "Wonder Woman",
        "Gender": "female",
        "InterestedIn": "any",
        "DateOfBirth": "1981-03-15",
        "KnownAs": "Wonder Woman",
        "Created": "2021-02-01",
        "LastActive": "2022-11-28",
        "Introduction": "As an Amazonian princess and a protector of the world, I am searching for someone who can keep up with my bravery and strength. I enjoy fighting for justice, using my lasso of truth, and spending time on my island home of Themyscira.",
        "LookingFor": "I am looking for a partner who is confident, compassionate, and is not afraid to stand up for what is right.",
        "Interests": "Fighting for justice, spending time on Themyscira, and exploring the world.",
        "City": "Washington D.C.",
        "State": "District of Columbia",
        "Photos": [
            {
                "Url": "https://res.cloudinary.com/littleboomgames/image/upload/v1675316925/DatingApp/wonderwoman_jg04i1.jpg",
                "IsMain": true
            }
        ]
    },
    {
        "UserName": "Spider-Man",
        "Gender": "male",
        "InterestedIn": "female",
        "DateOfBirth": "1995-05-10",
        "KnownAs": "Spider-Man",
        "Created": "2020-08-05",
        "LastActive": "2021-12-01",
        "Introduction": "As the friendly neighborhood Spider-Man, I spend my days fighting crime and protecting the people of New York. When I'm not web-slinging, I enjoy photography, science, and cracking jokes to lighten the mood.",
        "LookingFor": "I am looking for someone who understands my secret identity, supports my superhero activities, and shares my love for life in the city.",
        "Interests": "Fighting crime, photography, and exploring New York.",
        "City": "New York",
        "State": "New York",
        "Photos": []
    },
    {
        "UserName": "InvisibleWoman",
        "Gender": "female",
        "InterestedIn": "male",
        "DateOfBirth": "1988-01-05",
        "KnownAs": "The Invisible Woman",
        "Created": "2019-05-15",
        "LastActive": "2021-12-23",
        "Introduction": "I am a master of invisibility and have the ability to turn myself and others invisible. I use my powers to protect others and fight for what is right, and in my free time, I enjoy exploring new places and experiencing new things.",
        "LookingFor": "I am looking for a hero who understands the importance of keeping our identities hidden and is passionate about making a difference in the world. Someone who is confident, kind, and spontaneous would be the perfect match for me!",
        "Interests": "Invisibility, adventure, and making a difference.",
        "City": "Gotham",
        "State": "California",
        "Photos": [
            {
                "Url": "https://res.cloudinary.com/littleboomgames/image/upload/v1675316924/DatingApp/invisiblewoman_k0oodf.jpg",
                "IsMain": true
            }
        ]
    },
    {
        "UserName": "ElectricAura",
        "Gender": "female",
        "InterestedIn": "male",
        "DateOfBirth": "1982-06-22",
        "KnownAs": "Electric Aura",
        "Created": "2019-11-28",
        "LastActive": "2020-05-06",
        "Introduction": "I am a superhero with the ability to manipulate electricity and create electric fields. I love to use my powers for good and help those in need. When I'm not saving the world, I enjoy reading, traveling, and trying new foods. I am looking for someone who is kind, adventurous, and has a sense of humor.",
        "LookingFor": "I am looking for a superhero who is confident, compassionate, and driven. Someone who values honesty, communication, and mutual respect in a relationship. Bonus points if you have a unique super power that complements mine!",
        "Interests": "Reading, traveling, trying new foods",
        "City": "Metropolis",
        "State": "New York",
        "Photos": [
            {
                "Url": "https://res.cloudinary.com/littleboomgames/image/upload/v1675316925/DatingApp/electricaura_fvstar.jpg",
                "IsMain": true
            }
        ]
    },
    {
        "UserName": "ShadowNinja",
        "Gender": "female",
        "InterestedIn": "female",
        "DateOfBirth": "1988-12-01",
        "KnownAs": "Shadow Ninja",
        "Created": "2019-11-28",
        "LastActive": "2020-05-06",
        "Introduction": "I am a superhero who has the ability to manipulate shadows and turn invisible. I have honed my ninja skills to perfection and use them to protect the innocent and fight against evil. I am a quiet and reserved person, but I have a great sense of humor and love to make people laugh. I am looking for someone who is down-to-earth, caring, and shares my love for adventure.",
        "LookingFor": "I am looking for a superhero who is confident, adventurous, and has a strong sense of morality. Someone who is understanding, supportive, and will stand by me in any situation. Bonus points if you have a unique super power that we can use to save the world together!",
        "Interests": "Meditation, training, adventure",
        "City": "Gotham",
        "State": "New York",
        "Photos": [
            {
                "Url": "https://res.cloudinary.com/littleboomgames/image/upload/v1675316924/DatingApp/shadowninja_f2baot.jpg",
                "IsMain": true
            }
        ]
    },
    {
        "UserName": "Superman",
        "Gender": "male",
        "InterestedIn": "female",
        "DateOfBirth": "1982-06-15",
        "KnownAs": "Superman",
        "Created": "2019-11-28",
        "LastActive": "2022-05-06",
        "Introduction": "Born on the planet Krypton, I am a superhero with superhuman abilities and powers. I am known as the Man of Steel and have been fighting for truth, justice and the American way for many years. I use my abilities to protect and save humanity and am always looking for new ways to make the world a better place.",
        "LookingFor": "I am looking for a partner who shares my values and beliefs, and who is also passionate about making the world a better place. A partner who can keep up with my fast-paced lifestyle and who is not intimidated by my powers would be ideal.",
        "Interests": "Saving the world, reading, and spending time with loved ones.",
        "City": "Metropolis",
        "State": "New York",
        "Photos": [
            {
                "Url": "https://res.cloudinary.com/littleboomgames/image/upload/v1675316925/DatingApp/superman_wbekvy.jpg",
                "IsMain": true
            }
        ]
    },
    {
        "UserName": "IronMan",
        "Gender": "male",
        "InterestedIn": "female",
        "DateOfBirth": "1976-05-29",
        "KnownAs": "Iron Man",
        "Created": "2018-11-01",
        "LastActive": "2022-01-31",
        "Introduction": "I am a genius inventor and businessman, using my advanced technology and suit of armor to protect the world and fight for justice. In my free time, I enjoy tinkering with new technology and spending time with my loved ones.",
        "LookingFor": "I am looking for a hero who is intelligent, independent, and has a love for technology. Someone who is confident, caring, and spontaneous would be the perfect match for me!",
        "Interests": "Inventing, technology, and spending time with loved ones.",
        "City": "Metropolis",
        "State": "Illinois",
        "Photos": [
            {
                "Url": "https://res.cloudinary.com/littleboomgames/image/upload/v1675316924/DatingApp/ironman_elqbfq.jpg",
                "IsMain": true
            }
        ]
    },
    {
        "UserName": "CaptainAmerica",
        "Gender": "male",
        "InterestedIn": "female",
        "DateOfBirth": "1918-07-04",
        "KnownAs": "Captain America",
        "Created": "2021-01-15",
        "LastActive": "2022-12-31",
        "Introduction": "As a symbol of American patriotism and a defender of freedom, I fight for what is right and never back down. When I'm not saving the world, I enjoy working out, reading history books, and practicing my shield-throwing skills.",
        "LookingFor": "I am looking for a partner who is patriotic, brave, and believes in the power of freedom.",
        "Interests": "Defending freedom, working out, and reading history books.",
        "City": "Washington D.C.",
        "State": "District of Columbia",
        "Photos": []
    },
    {
        "UserName": "BlackWidow",
        "Gender": "female",
        "InterestedIn": "any",
        "DateOfBirth": "1984-07-01",
        "KnownAs": "Black Widow",
        "Created": "2021-05-01",
        "LastActive": "2022-12-15",
        "Introduction": "As a former KGB agent and a current Avenger, I am skilled in espionage, combat, and quick thinking. When I'm not saving the world, I enjoy practicing my combat skills, traveling, and learning new languages.",
        "LookingFor": "I am looking for a partner who is confident, adventurous, and understands the dangers of my line of work.",
        "Interests": "Combat training, traveling, and learning new languages.",
        "City": "New York",
        "State": "New York",
        "Photos": [
            {
                "Url": "https://res.cloudinary.com/littleboomgames/image/upload/v1675316925/DatingApp/blackwidow_kyvx9r.jpg",
                "IsMain": true
            }
        ]
    },
    {
        "UserName": "Thor",
        "Gender": "male",
        "InterestedIn": "male",
        "DateOfBirth": "1980-06-20",
        "KnownAs": "Thor",
        "Created": "2020-12-01",
        "LastActive": "2022-11-30",
        "Introduction": "As the prince of Asgard and a powerful Asgardian, I wield Mjolnir and protect both Asgard and Midgard. When I'm not battling evil, I enjoy drinking with my friends, training with my hammer, and exploring new realms.",
        "LookingFor": "I am looking for a partner who is fearless, strong, and not intimidated by my godly power.",
        "Interests": "Defending Asgard, training with Mjolnir, and exploring new realms.",
        "City": "Asgard",
        "State": "Asgard",
        "Photos": [
            {
                "Url": "https://res.cloudinary.com/littleboomgames/image/upload/v1675316925/DatingApp/thor_q6eabz.jpg",
                "IsMain": true
            }
        ]
    },
    {
        "UserName": "SheHulk",
        "Gender": "female",
        "InterestedIn": "male",
        "DateOfBirth": "1980-04-20",
        "KnownAs": "She-Hulk",
        "Created": "2021-06-01",
        "LastActive": "2022-12-31",
        "Introduction": "As a lawyer by day and a superhero by night, I have the ability to transform into the She-Hulk and wield immense strength and invincibility. When I'm not fighting crime, I enjoy reading legal briefs, practicing martial arts, and cracking jokes.",
        "LookingFor": "I am looking for a partner who is intelligent, confident, and can handle my alter ego.",
        "Interests": "Fighting crime, reading legal briefs, and practicing martial arts.",
        "City": "New York",
        "State": "New York",
        "Photos": [
            {
                "Url": "https://res.cloudinary.com/littleboomgames/image/upload/v1675316924/DatingApp/shehulk_knw396.jpg",
                "IsMain": true
            }
        ]
    },
    {
        "UserName": "ScarletWitch",
        "Gender": "female",
        "InterestedIn": "male",
        "DateOfBirth": "1983-07-06",
        "KnownAs": "Scarlet Witch",
        "Created": "2021-01-01",
        "LastActive": "2022-12-31",
        "Introduction": "As a powerful mutant and a member of the X-Men, I possess reality-warping abilities and the power of the hex. When I'm not saving the world, I enjoy reading, practicing magic, and spending time with my brother Quicksilver.",
        "LookingFor": "I am looking for a partner who is understanding, empathetic, and can handle my vast abilities.",
        "Interests": "Using my abilities for good, reading, and practicing magic.",
        "City": "New York",
        "State": "New York",
        "Photos": [
            {
                "Url": "https://res.cloudinary.com/littleboomgames/image/upload/v1675316925/DatingApp/scarletwitch_cxtsuf.jpg",
                "IsMain": true
            }
        ]
    },
    {
        "UserName": "Mystique",
        "Gender": "female",
        "InterestedIn": "any",
        "DateOfBirth": "1977-11-15",
        "KnownAs": "Mystique",
        "Created": "2019-12-01",
        "LastActive": "2020-05-08",
        "Introduction": "I am a shape-shifting mutant with the ability to change my appearance into anyone I want. I use my powers to gather information and get myself out of sticky situations.",
        "LookingFor": "I am looking for someone who is smart, resourceful, and able to adapt to any situation. Someone who can be a partner in crime and a true friend.",
        "Interests": "Traveling the world, collecting valuable information, and finding new ways to use my powers for good.",
        "City": "Gotham",
        "State": "California",
        "Photos": [
            {
                "Url": "https://res.cloudinary.com/littleboomgames/image/upload/v1675316924/DatingApp/mystique_o7mrq4.jpg",
                "IsMain": true
            }
        ]
    }
]